config.org
#+TITLE: My emacs configuration

* Set user data

Place your private configuration here! Remember, you do not need to run 'doom
sync' after modifying this file!

Some functionality uses this to identify you, e.g. GPG configuration, email
clients, file templates and snippets.

#+begin_src emacs-lisp
;;; $DOOMDIR/config.el -*- lexical-binding: t; -*-
(setq user-full-name "Zamachi"
      user-mail-address "dstefa.dimitrijevic7@gmail.com")
#+end_src

* Basic UI Config

** Font config

Doom exposes five (optional) variables for controlling fonts in Doom. Here
are the three important ones:

 + `doom-font'
 + `doom-variable-pitch-font'
 + `doom-big-font' -- used for `doom-big-font-mode' use this for
   presentations or streaming.

They all accept either a font-spec, font string ("Input Mono-12"), or xlfd
font string. You generally only need these two:
 - (setq doom-font (font-spec :family "monospace" :size 12 :weight 'semi-light)
        doom-variable-pitch-font (font-spec :family "sans" :size 13))

#+begin_src emacs-lisp

;;fontovi
(setq  doom-font(font-spec :family "Fira Code" :height 220)
       doom-variable-pitch-font(font-spec :family "Cantarell" :height 130))
#+end_src

** Color theme configuration

 There are two ways to load a theme. Both assume the theme is installed and
 available. You can either set `doom-theme' or manually load a theme with the
 `load-theme' function.
#+begin_src emacs-lisp
;;doom theme
(setq doom-theme 'doom-outrun-electric)
#+end_src

** Number line mode
This determines the style of line numbers in effect. If set to `nil', line
numbers are disabled. For relative line numbers, set this to `relative'.

#+begin_src emacs-lisp
(setq display-line-numbers-type t)
(dolist (mode '(org-mode-hook
                term-mode-hook
                shell-mode-hook
                treemacs-mode
                eshell-mode-hook))
  (add-hook mode (lambda () (display-line-numbers-mode 0))))
#+end_src

* Keybinding configurations
** General

KORISTI SE DA SETUJE KEYBINDINGE U GLOBALU I ZA SPECIFICAN MODE(major & minor (?) )
keymaps specificira za koji mode(ili modove) vaze pravila. Mode se definise kao:
IME-MODA-map (npr. clojure-mode-map)
prefixi specificiraju kako se ulazi u definer, zatim se iz samog definera izvlace bindovi, global-prefix radi bez obzira gde se nalazili (I think?)

#+begin_src emacs-lisp
;; (use-package! general
;;   :config
;;   (general-create-definer zama/leader-keys
;;     :keymaps '(normal visual emacs)
;;     :global-prefix "SPC z")

;;   (zama/leader-keys
;;     "t"  '(:ignore t :which-key "toggles")
;;     "tt" '(counsel-load-theme :which-key "choose theme")))

#+end_src

[[https://github.com/noctuid/general.el][General dokumentacija]]
** Evil

Vim emulation sloj za emacs
Shift-V ulazi u visual(line) mode
Ctr-G(escape) ulazi u normal mode)
slovo i sluzi za insert
"dd" u normal modu brise liniju
"u" u normal modu radi undo (samo brisanja ?)
Ctrl-Z switchuje izmedju normal mode(Vim/evil) i "emacs" mode

[[https://github.com/emacs-evil/evil][Evil dokumentacija
]]
| Evil normal mode |                                    |
| Skracenica       | Opis                               |
| C-v              | duplira liniju                     |
| u                | undo                               |
| C-z              | switch na Emacs mode               |
| i                | Switch na insert mode              |
| Shift-V          | Visual line mode                   |
| dd               | brise liniju                       |
| d                | Brise selektovani sadrzaj i kopira |
| y                | Yank(copy) selektovanog            |
| P                | Nalepi sadrzaj PRE kursora         |
| p                | Nalepi sadrzaj NAKON kursora       |
| C-w              | Window manager (?)                 |
| j                | Next visual line                   |
| k                | Previous Visual line               |
| C-a              | Beginning of the line              |
| C-e              | End of the line                    |

| Evil insert mode |                  |
| Skracenica       | opis             |
| C-g/escape       | Switch na normal |
| Shift-insert     | Paste            |

| Evil visual line mode |                                  |
| Skracenica            | opis                             |
|-----------------------+----------------------------------|
| g c                   | zakomentarise selektovane linije |
** Evil collections

Dodatni keybindinzi koje sam Evil ne pokriva po difoltu

[[https://github.com/emacs-evil/evil-collection][Evil collection dokumentacija]]
* UI Configuration
** Better Modeline

Instalirati fontove ako se ne vide! *M-x install all font icons*

** Solaire mode

Na Doom Emacs-u instalirano po Default-u

** Which key

Konfigurisano po default-u na Doom Emacsu.

** Ivy and Counsel

[[https://oremacs.com/swiper/][Ivy]]je genericki completion alat ( koristi ivy-mode ).
Swiper je alternativa za ugradjeni isearch koji dobro radi sa Ivyjem
Counsel pruzi ekvivalente za Emacs komande(sa nekim dodatnim opcijama) (counsel-mode)

#+begin_src emacs-lisp
        ;;koristi ivy package, koji ima bolji autocomplete za meta- funkcional.(medju ostalim funkc.)

        ;; (use-package! ivy
        ;;   :diminish
        ;;   :bind (("C-s" . swiper)
        ;;          :map ivy-minibuffer-map
        ;;          ("TAB" . ivy-alt-done)
        ;;          ("C-f" . ivy-alt-done)
        ;;          ("C-l" . ivy-alt-done)
        ;;          ("C-j" . ivy-next-line)
        ;;          ("C-k" . ivy-previous-line)
        ;;          :map ivy-switch-buffer-map
        ;;          ("C-k" . ivy-previous-line)
        ;;          ("C-l" . ivy-done)
        ;;          ("C-d" . ivy-switch-buffer-kill)
        ;;          :map ivy-reverse-i-search-map
        ;;          ("C-k" . ivy-previous-line)
        ;;          ("C-d" . ivy-reverse-i-search-kill))
        ;;   :config
        ;;   (ivy-mode 1))
        ;;obogacuje ivy packet sa opisom funkcionalnosti i keybindovima(ako ih imaju)
        ;; (use-package! ivy-rich
        ;;   :after ivy
        ;;   :init
        ;;   (ivy-rich-mode 1))

;;         counsel paket, koji koristi ivy rich, da dodatno obogati meta-pretrage, C-x C-f i dr.
        (use-package! counsel
          :after ivy-rich
          :config
          (counsel-mode 1))
#+end_src

Kako se koristi

| funkcija          | precica | opis                                       |
|-------------------+---------+--------------------------------------------|
| Swiper            | SPC s b | Trazi string po regexu za dati buffer      |
| Find file         | SPC .   | Pronadji fajl                              |
| Counsel buffer    | SPC b B | Bira se na koji buffer ce se prebaciti     |
| Describe function | SPC h f | Opisuje funkciju                           |
| Describe variable | SPC h v | Opisuje promenljivu                        |
| Describe face     | SPC h F | Opisuje face atribut fontova               |
| Describe key      | SPC h k | Opisuje uneti keybind(ukoliko je bindovan) |
| Describe mode     | SPC h m | Opisuje trenutni (major?) mode             |
|                   |         |                                            |

Ako se u M-x u ne vidi opis funkcionalnosti, uraditi reset ivy-rich-mode-a

** Helpful

koristi counsel funkcionalnosti i helpful funkcionalnosti da overriduje defaultna ponasanja emacs-a npr. za describe-function ili bilo koje druge describe- funkcionalnosti
Na Doomu konfigurisano po default-u

** Text scaling
*** Hydra
Hydra se koristi kod buffer cycling-a, ali i za skaliranje teksta

Primer koriscenja: zamislimo da imamo C-c j i C-c k bindovano u konfiguraciji, i zelimo te dve komande da pozivamo u nekoj proizvoljnoj sekvenci, npr. C-c jjkkjkjkj, ovo nam dozvoljava Hydra paket, da ne pretiskamo C-c svaki put, vec samo jednom i da u sekvenci mozemo da zadajemo jjkkkjj naredbe, sto smo ovde iskoristili za povecavanje teksta.

#+begin_src emacs-lisp
  ;; (use-package! hydra
  ;;   :defer t)

  ;; (defhydra hydra-text-scale (:timeout 4)
  ;;   "scale text"
  ;;   ("j" text-scale-increase "in")
  ;;   ("k" text-scale-decrease "out")
  ;;   ("f" nil "finished" :exit t))

  ;; (zama/leader-keys
  ;;   "ts" '(hydra-text-scale/body :which-key "scale text"))
#+end_src

* Org mode
** Better font faces
#+begin_src emacs-lisp
(defun efs/org-font-setup ()
  ;; Replace list hyphen with dot
  (font-lock-add-keywords 'org-mode
                          '(("^ *\\([-]\\) "
                             (0 (prog1 () (compose-region (match-beginning 1) (match-end 1) "•"))))))

  ;; Set faces for heading levels
  (dolist (face '((org-level-1 . 1.2)
                  (org-level-2 . 1.1)
                  (org-level-3 . 1.05)
                  (org-level-4 . 1.0)
                  (org-level-5 . 1.1)
                  (org-level-6 . 1.1)
                  (org-level-7 . 1.1)
                  (org-level-8 . 1.1)))
    (set-face-attribute (car face) nil :font "Cantarell" :weight 'regular :height (cdr face)))

  ;; Ensure that anything that should be fixed-pitch in Org files appears that way
  (set-face-attribute 'org-block nil :foreground nil :inherit 'fixed-pitch)
  (set-face-attribute 'org-code nil   :inherit '(shadow fixed-pitch))
  (set-face-attribute 'org-table nil   :inherit '(shadow fixed-pitch))
  (set-face-attribute 'org-verbatim nil :inherit '(shadow fixed-pitch))
  (set-face-attribute 'org-special-keyword nil :inherit '(font-lock-comment-face fixed-pitch))
  (set-face-attribute 'org-meta-line nil :inherit '(font-lock-comment-face fixed-pitch))
  (set-face-attribute 'org-checkbox nil :inherit 'fixed-pitch))
#+end_src
** Basic org mode conf
#+begin_src emacs-lisp
  (defun efs/org-mode-setup ()
    (org-indent-mode)
    (variable-pitch-mode 1)
    (auto-fill-mode 0)
    (visual-line-mode 1)
    (setq evil-auto-indent nil))

  (use-package! org
    :commands (org-capture)
    :hook (org-mode . efs/org-mode-setup)
    :config
    (setq org-ellipsis " ▼"
          org-hide-emphasis-markers t)
    (efs/org-font-setup))
#+end_src
** Nicer bullets for headings
#+begin_src emacs-lisp
(use-package! org-bullets
  :after org
  :hook (org-mode . org-bullets-mode)
  :custom
  (org-bullets-bullet-list '("◉" "○" "●" "○" "●" "○" "●")))

#+end_src
** Center org buffers
#+begin_src emacs-lisp
(defun efs/org-mode-visual-fill ()
  (setq visual-fill-column-width 100
        visual-fill-column-center-text t)
  (visual-fill-column-mode 1))

(use-package! visual-fill-column
  :hook (org-mode . efs/org-mode-visual-fill))
#+end_src
** Configure babel languages
    Doom ih konfigurise za nas...
