config.org
** Structure templates
#+begin_src emacs-lisp
    ;; (with-eval-after-load 'org
    ;;   (require 'org-tempo)

    ;;   (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
    ;;   (add-to-list 'org-structure-template-alist '("py" . "src python"))
    ;;   (add-to-list 'org-structure-template-alist '("lua" . "src lua"))

    ;;   )

(after! org
  (require 'org-tempo)
  (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
  (add-to-list 'org-structure-template-alist '("py" . "src python"))
  (add-to-list 'org-structure-template-alist '("lua" . "src lua"))
  )
#+end_src

** Auto-tangle configuration files

Basically automatically tangles this config file(saves it to another file), but just the codeblocks
  ;; (defun efs/org-babel-tangle-config ()
  ;;   (when (string-equal (buffer-file-name)
  ;;                       (expand-file-name "~/.doom.d/config.org"))
  ;;     ;; Dynamic scoping to the rescue
  ;;     (let ((org-confirm-babel-evaluate nil))
  ;;       (org-babel-tangle))))

  ;; (add-hook 'org-mode-hook (lambda () (add-hook 'after-save-hook #'efs/org-babel-tangle-config)))

No

* Development
** Commenting
Koristi se Evil nerd commenter, u Visual Line Mode(Shift-V) selektovati linije i pritisnuti *g c*

** Languages
*** Language Servers

LSP je Language Server Protocol koji se koristi da dostavi informaciju o autocompletion-u i slicnim stvarima vezanim za sintaksu jezika.

#+begin_src emacs-lisp
(add-hook! lsp-mode
  (defun breadcrumb-setup ()
           (setq lsp-headerline-breadcrumb-segments '(path-up-to-project file symbols))
           (lsp-headerline-breadcrumb-mode))
    )
#+end_src

Usage of LSP - works only if language is provided:

| command                        | shortcut    | description                                       |
|--------------------------------+-------------+---------------------------------------------------|
| Find references                | C-c l g r   | Pronalazi sve reference selektovanog simbola radi |
| Find definitions               | C-c l g g   | Isto kao iznad, samo pronalazi  definicije        |
| Rename                         | C-c l r r   | Preimenuje selektovan simbol                      |
| Flymake diagnostics buffer     |             | Dijagnostika gresaka u datom fajlu - greske, warn |
| Code formatting                | C-c l = =   | Reformatira kod kako ih language serv. formatira  |
| lsp-treemacs-symbols           | M-x command | Show a tree view of symbols in the file           |
| lsp-treemacs-references        | M-x command | Show a tree view for refs of symbol under cursor  |
| lsp-treemacs-error-list        | M-x command | Show a tree veiw for diagnostic msgs              |
| lsp-ivy-workspace-symb         | M-x command | Search for a symbol name in the current project   |
| lsp-ivy-global-workspace-sym   | M-x command | Searches in all active project workspaces         |
| treemacs                       |             | Opens the treemacs view on the side               |
| lsp-ui-sideline-enable         |             | Enables lsp-ui sideline (possibly won't work ?)   |
| lsp-headerline-breadcrumb-mode |             | Enables breadcrumb for the project                |
**** Documentation

[[https://github.com/emacs-lsp/lsp-ui][LSP-UI documentation]]
*** DAP mode and Debugging
Dap-mode je paket za debugging putem Debugging Adapter Protocol. Debager za svaki jezik se konfigurise posebno
[[https://github.com/emacs-lsp/dap-mode][Dokumentacija DAP-mode.]]


#+begin_src emacs-lisp
    ;; (require 'dap-node)
    ;; (dap-node-setup);; Automatically installs Node debug adapter if needed

    ;; Sa "C-c l d" otvori se dap-hydra prozor za lakse debagovanje
    ;; (general-define-key
    ;;   :keymaps 'lsp-mode-map
    ;;   :prefix lsp-keymap-prefix
    ;;   "d" '(dap-hydra t :wk "debugger"))
#+end_src

Ukljucuje se sa *M-x Dap-debug-mode*, a onda ce pitati da se selektuje konfiguracioni templejt. LSP-mode mora biti aktivan u bufferu. Konfiguracije se moze menjati sa *M-x dap-debug-recent.*  Editovanje konfiguracija se vrsi sa *M-x dap-debug-edit-templates.*
Konfiguracioni templejti se najcesce cuvaju u posebnom fajlu, unutar korenog direktorijuma projekta npr.,  tipa *debug.el* gde se nalepi templejt sledeceg izgleda:

(dap-register-debug-template
"ime-templejta"
(list :type "tip-debuggera"(npr node)
        :cwd nil <- podesava trenutni radni direktorijum
        :request "launch"
        :program nil <- koji program ce se pokrenuti
        :name "opet-ime")), koristi se konfiguracija sa *VSCodea*

Templejt treba evaluirati (*C-x C-e*) pre nego sto postane dostupan.

[[https://emacs-lsp.github.io/dap-mode/page/configuration/#dap-mode-configuration][Konfiguracija DAP mode-a.]]

**** Breakpoints

Breakpoint se dodaje sa *M-x dap-breakpoint-toggle* naredbom.
Da se otvori prikaz sa Breakpointima, pokrece se komanda *M-x dap-ui-breakpoints* i kada se zavrsi, moze se izaci pritiskom na taster q
*M-x dap-breakpoint-log-message* dodaje custom poruku koja se ispisuje kada debugger dodje na breakpoint. Sa *{ promenljiva iz koda }* mozemo evaluirati neki izraz.
Moze se dodati breakpoint i sa uslovom: *M-x dap-breakpoint-condition*. Uslov se pise u jeziku koji se debaguje (?)

Takodje mozemo dodati *watch expressions* - odnosno promenljive cije vrednosti zelimo da se ispisuju u panelu "Expressions", jednostavno pozovemo naredbu *M-x dap-ui-expressions-add ime-promenljive* i ta promenljiva iz koda ce se ispisivati u pogledu.
Uklanja se sa *M-x dap-ui-expressions-remove*.

Da se prikazu lokalne varijable, koristi se funkcija *M-x dap-ui-locals*.

**** Navigacija

Sa *M-x dap-next* se prelazi na sledecu liniju u kodu.

Promena funkcije na stacku se vrsi sa *dap-switch-stack-frame*

**** Sesije

Sesija se resetuje sa *M-x dap-debug-restart*.
Debugger se gasi sa *M-x dap-disconnect*
Prikaz svih sesija za debagovanje *M-x dap-ui-sessions* , ako se onda prebacimo na taj view i pretisnemo *D(u Emacs mode-u - C-z)* onda se obrise sesija.

Paleta komandi: *M-x dap-hydra*

**** REPL

	Aktivira se sa *M-x dap-ui-repl* ukoliko dap adapter za dati jezik podrzava interaktivnu konzolu. U sustini interaktivna konzola nam dozvoljava da tokom izvrsavanja menjamo kod - mogu se cak i vrednosti menjati dinamicki

****  VSCode debug config

		VSCode cuva konfiguracije debuggera u *.vscode folderu( debug.json )* i to se moze iskoristiti i u Emacsu, jer je isti debugger adapter i debug protokol!

*** TypeScript
    Configured by default by Doom ( ? not confirmed )
*** Lua

**** Love minor mode

Lua and love minor mode active by default

*** Python

Python mode sa Pyrightom aktiviran u init.el
#+begin_src emacs-lisp
(use-package! pyvenv
  :init
  (setenv "WORKON_HOME" "~/.venvs/")
  :config
  ;; (pyvenv-mode t)

  ;; Set correct Python interpreter
  (setq pyvenv-post-activate-hooks
        (list (lambda ()
                (setq python-shell-interpreter (concat pyvenv-virtual-env "bin/python")))))
  (setq pyvenv-post-deactivate-hooks
        (list (lambda ()
                (setq python-shell-interpreter "python3")))))
#+end_src
***  C++

#+begin_src emacs-lisp
  ;; (require 'dap-cpptools)
  ;; (add-hook 'c++-mode-hook 'lsp)
#+end_src


** Company mode

Provides a nicer in-buffer completion interface.
Company box further enhances the looks and icons and presentation
Aktivno sve po defaultu od strane Doom-a
** Projectile

 Emacs ima koncept DIRECTORY LOCAL VARIABLES - kreira se fajl u repo folderu koji konfigurise emacs varijable, koje ce se primeniti na odredjene fajlove u projektu svaki put kad se otvori bafer koji cita fajl iz datog foldera:
  	- y - otvara .dir-locals.el unutar (trenutnog ?) repo-a, koji predstavlja taj konfiguracioni fajl u sustini...
	NAREDBE KOJE SE MOGU KORISTITI:
		+ projectile-project-run-cmd - koja naredba se izvrsava kada se uradi C-c p-p

 Kada se zavrsi editovanje i sacuva fajl, treba da se uradi evaluate (M-:) sa naredbom: (hack-dir-local-variables) i reloaduje ove promenljive iz dir-locals.el fajla.

#+begin_src emacs-lisp
  ;;projectile project interaction library for emacs. Offers functionalities for projects

  (use-package! counsel-projectile
    :after projectile
    :config (counsel-projectile-mode))
#+end_src

| funkcija                   | skracenica | opis                                         |
|----------------------------+------------+----------------------------------------------|
| projectile-edit-dir-locals | C-c p E    | Otvara .dir-locals.el unutar trenutnog repoa |
| projectile-project-run-cmd | C-c p-p    | Pokrece se projekat                          |
| hack-dir-local-variables   |            | Refreshuje .dir-locals.el kada se izmeni     |
| projectile menu            | C-c p      | Otvara projectile menu                       |


| Projectile menu komande   |            |                                                    |
| Funkcija                  | skracenica | opis                                               |
| projectile-switch-project | p          | Menja projekat                                     |
| fuzzy search              | f          | Fuzzy search u projektnom folderu                  |
| Testing project           | P          | Pokrece testove u datom projektu (?)               |
| (?)                       | Alt-o      | Prikazuje dodatne funkcionalnosti za dati projekat |
| counsel-projectile-rg     |            | Grep komanda, samo sto trazi po celom projektu     |

** Basic Magit setup

Doom setupuje Magit korektno

| Funkcija       | skracenica | opis                                                    |
|----------------+------------+---------------------------------------------------------|
| Magit status   | C-x g      | Status verzionnisanja                                   |
| Staging        | C-x g s    | Staging fajlova                                         |
| Stage all      | C-x g S    | Staging svih fajlova                                    |
| Unstaging      | C-x g u    | Unstaging fajla                                         |
| Unstage all    | C-x g U    | Unstaging svih fajlova                                  |
| Branches       | C-x g b    | Otvara panel sa branches                                |
| Create branch  | C-x g b c  | Kreira branshu                                          |
| (?)            | C-x g b s  | (?)                                                     |
| Switch branch  | C-x g b b  | Menja tekucu branshu ( ZAHTEVA DA SE STASHUJU PROMENE ) |
| Commit panel   | C-x g c    | Panel sa commitovanjem                                  |
| Commit fajla   | C-x g c c  | Komituje fajl (C-c C-k to cancel)                       |
| Fixup fajla    | C-x g c F  | Fixuje prethodni komit(umesto rebase-ovanja)            |
| Stash list     | C-x g z    | Otvara stash listu                                      |
| Stash changes  | C-x g z z  | Stashuje promene                                        |
| Push panel     | C-x g p    | Otvara push panel                                       |
| Push to remote | C-x g p p  | pushuje na remote                                       |
| Fork(?)        | C-x g p u  | Nesto za forkovanje (?)                                 |
| Push elsewhere | C-x g p e  | Pushuje na neki drugi remote                            |
| Force push     | C-x g p f  | Forsira push ako failuje sa nekim REFS-ovima            |

** Forge

Forge konfigurisan od strane Doom-a

[[https://github.com/magit/forge][Documentation page for Forge]]

NOTE: konfigurisi GitHub token pre nego sto koristis Forge!

[[https://magit.vc/manual/forge/Token-Creation.html#Token-Creation][*** Kreacija tokena]]
[[https://magit.vc/manual/ghub/Getting-Started.html#Getting-Started][*** Getting started]]


** Rainbow delimiters

Delimiteri duginih boja kao visual aid tokom razvoja
 Doom automatski regulise delimitere
** Devdocs - Emacs viewer for DevDocs

It's a "Viewer" for documentation from the [[https://devdocs.io/][DevDocs website.]]

#+begin_src emacs-lisp
(use-package! devdocs
  :commands(devdocs-install devdocs-search devdocs-lookup))
#+end_src

How to use:
1. Download documentation with M-x devdocs-install, this will query the DevDocs website for available documents and save to disk;
2. Call M-x devdocs-lookup to search for entries

The first time you call the devdocs-lookup will show a list of docs to search ( you can select more than one via comma-seperated list). Every other call to this function will search in these docs(unless you give a prefix, which lets you select new docs). The current devdocs can be set up via devdocs-current-docs directly, dir-local variables or mode hooks:
#+begin_src emacs-lisp
;;(add-hook 'python-mode-hook
;;          (lambda () (setq-local devdocs-current-docs '("python~3.9"))))
#+end_src

* Terminals

** PowerShell

This should integrate PowerShell on Windows with Emacs

#+begin_src emacs-lisp
  (if (eq system-type 'windows-nt )
      (use-package! powershell
        :commands shell
        :config
        ;; Change default compile command for powershell
        (add-hook 'powershell-mode-hook
                  (lambda ()
                    (set (make-local-variable 'compile-command)
                         (format "powershell.exe -NoLogo -NonInteractive -Command \"& '%s'\"" ))))))
#+end_src

Run command M-x powershell to run it
* Dired

