config.el

;; (with-eval-after-load 'org
    ;;   (require 'org-tempo)

    ;;   (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
    ;;   (add-to-list 'org-structure-template-alist '("py" . "src python"))
    ;;   (add-to-list 'org-structure-template-alist '("lua" . "src lua"))

    ;;   )

(after! org
  (require 'org-tempo)
  (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
  (add-to-list 'org-structure-template-alist '("py" . "src python"))
  (add-to-list 'org-structure-template-alist '("lua" . "src lua"))
  )

(add-hook! lsp-mode
  (defun breadcrumb-setup ()
           (setq lsp-headerline-breadcrumb-segments '(path-up-to-project file symbols))
           (lsp-headerline-breadcrumb-mode))
    )

;; (require 'dap-node)
;; (dap-node-setup);; Automatically installs Node debug adapter if needed

;; Sa "C-c l d" otvori se dap-hydra prozor za lakse debagovanje
;; (general-define-key
;;   :keymaps 'lsp-mode-map
;;   :prefix lsp-keymap-prefix
;;   "d" '(dap-hydra t :wk "debugger"))

;; (require 'dap-cpptools)
;; (add-hook 'c++-mode-hook 'lsp)

;;projectile project interaction library for emacs. Offers functionalities for projects

(use-package! counsel-projectile
  :after projectile
  :config (counsel-projectile-mode))

(use-package! devdocs
  :commands(devdocs-install devdocs-search devdocs-lookup))

;;(add-hook 'python-mode-hook
;;          (lambda () (setq-local devdocs-current-docs '("python~3.9"))))

(if (eq system-type 'windows-nt )
    (use-package! powershell
      :commands shell
      :config
      ;; Change default compile command for powershell
      (add-hook 'powershell-mode-hook
                (lambda ()
                  (set (make-local-variable 'compile-command)
                       (format "powershell.exe -NoLogo -NonInteractive -Command \"& '%s'\"" ))))))

(use-package! dired
  :commands(dired dired-jump)
