config.org
** Dired basics
#+begin_src emacs-lisp
  (use-package! dired
    :commands(dired dired-jump)
    :custom ((dired-listing-switches "-agho --group-directories-first"))
    :config
    (evil-collection-define-key 'normal 'dired-mode-map
      "h" 'dired-single-up-directory
      "l" 'dired-single-buffer))
#+end_src

Navigation

| shortcut              | description                                    |
|-----------------------+------------------------------------------------|
| n/j                   | next line                                      |
| p/k                   | prev. line                                     |
| j/J                   | jump to file in buffer                         |
| RET                   | select file/dir                                |
| "^"                   | go to parent dir                               |
| S-RET/g O             | open file in the "other" window                |
| M-RET                 | show file in the other window without focusing |
| g o (dired-view-file) | open file in "preview mode". Close with q      |
| g r                   | refresh buffer with "revert-buffer"            |

Marking files

| command                  | shortcut   | description                              |
|--------------------------+------------+------------------------------------------|
| Ivy enter input verbatim | Ctrl-Alt-j | completes input without Ivy completion   |
|                          | m          | Marks a file                             |
|                          | u          | Unmarks                                  |
|                          | U          | Unmarks all files in the buffer          |
|                          | * t / t    | inverts marked files                     |
|                          | % m        | Mark files using regExp                  |
|                          | *          | Other auto-mark funcs.                   |
|                          | k / K      | Kill marked items(not delete, just hide) |
|                          |            |                                          |

Copying / renaming files

| command                          | description                                            |
|----------------------------------+--------------------------------------------------------|
| C                                | copy marked files                                      |
| U                                | unark all files                                        |
| R                                | rename marked files                                    |
| % R                              | rename based on regExp                                 |
| C-x C-q (dired-toggle-read-only) | Makes all items editable directly. Press ZZ to confirm |
|                                  |                                                        |

Deleting files

| command                   | description                |
|---------------------------+----------------------------|
| D                         | delete marked file         |
| d                         | mark file for deletion     |
| x                         | Execute deletion for marks |
| delete-by-moving-to-trash | Self-describing            |
|                           |                            |

Creating and extracting archives

| command                    | description                              |
|----------------------------+------------------------------------------|
| Z                          | (un)compress a file or folder to .tar.gz |
| c                          | Compress selection to a specific file    |
| dired-compress-files-alist | Tied to certain file extensions...       |
|                            |                                          |

** Dired single

Uses only a single instance of Dired

#+begin_src emacs-lisp
  (use-package! dired-single
    :commands (dired dired-jump))
#+end_src

| command             | shortcut | description                                 |
|---------------------+----------+---------------------------------------------|
| maybe-insert-subdir | I        | Insert selected subdir into same dired buff |
|                     |          |                                             |

** Dired open

Allows us to open certain files in different programs (other than Emacs)

#+begin_src emacs-lisp
(use-package! dired-open
  :commands (dired dired-jump)
  :config
  (setq dired-open-extensions '(("png" . "feh")
                                ("mkv" . "mpv"))))
#+end_src

* Runtime performance

Garbace collection happens more frequently but in less time

#+begin_src emacs-lisp
;; (setq gc-cons-treshold (* 2 1000 1000))
#+end_src
